<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [56]:
import pandas as pd
import psycopg2

In [71]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [72]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [65]:
# текст запроса
query_3_1 = f'''select count(id)
from VACANCIES 
'''

In [66]:
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\3851344990.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [61]:
query_3_2 = f'''select count(id)
from EMPLOYERS 
'''

In [62]:
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\3588252056.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [63]:
query_3_3 = f'''select count(id)
from AREAS 
'''

In [64]:
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\2018224393.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [67]:
# текст запроса
query_3_4 = f'''select count(id)
from INDUSTRIES 
'''

In [68]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных
#Мы имеем несколько таблиц, наполненных разнообразными данными

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [36]:
# текст запроса
query_4_1 = f'''select count(v.id) cnt,
a.name area
from VACANCIES v, areas a
where v.area_id=a.id
group by a.name
order by cnt  desc
limit 5
'''

In [37]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_60792\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [40]:
# текст запроса
query_4_2 = f'''select count(id) cnt
from VACANCIES 
where salary_from is not null or salary_to is not null 
'''

In [41]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_60792\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [43]:
# текст запроса
query_4_3 = f'''select avg(salary_from) sf,
avg(salary_to) st
from VACANCIES 
'''

In [44]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_60792\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

             sf             st
0  71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [33]:
# текст запроса
query_4_4 = f''' SELECT 
         count(schedule), 'Полный день — Полная занятость' schedule_employment
FROM 
         VACANCIES 
where schedule = 'Полный день' and employment = 'Полная занятость'         

UNION all

SELECT 
         count(schedule), 'Вахтовый метод — Проектная работа' 
FROM 
         VACANCIES
where schedule = 'Вахтовый метод' and employment = 'Проектная работа' 

UNION all

SELECT 
         count(schedule), 'Удаленная работа — Полная занятость' 
FROM 
         VACANCIES
where schedule = 'Удаленная работа' and employment = 'Полная занятость' 

UNION all

SELECT 
         count(schedule), 'Гибкий график — Полная занятость'
FROM 
         VACANCIES
where schedule = 'Гибкий график' and employment = 'Полная занятость' 

UNION all

SELECT 
         count(schedule), 'Удаленная работа — Частичная занятость' 
FROM 
         VACANCIES
where schedule = 'Удаленная работа' and employment = 'Частичная занятость' 
order by count desc
'''

In [34]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_65556\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

   count                     schedule_employment
0  35367          Полный день — Полная занятость
1   7802     Удаленная работа — Полная занятость
2   1593        Гибкий график — Полная занятость
3   1312  Удаленная работа — Частичная занятость
4      2       Вахтовый метод — Проектная работа

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [41]:
# текст запроса
query_4_5 = f''' SELECT 
         count(experience), 'Более 6 лет' exp
FROM 
         VACANCIES 
where experience = 'Более 6 лет'       
UNION 
SELECT 
         count(experience), 'От 3 до 6 лет' exp
FROM 
         VACANCIES 
where experience = 'От 3 до 6 лет' 
UNION 
SELECT 
         count(experience), 'От 1 года до 3 лет' exp
FROM 
         VACANCIES 
where experience = 'От 1 года до 3 лет'
UNION 
SELECT 
         count(experience), 'Нет опыта' exp
FROM 
         VACANCIES 
where experience = 'Нет опыта' 
order by count
'''

In [42]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_65556\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

   count                 exp
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

***

In [ ]:
# выводы по детальному анализу вакансий
#По количеству ваканчий лидируют: Москва, Санкт-Петербург, Минск, Новосибирск и Алматы, все это очень крупные города. Среди представленных данных мы выявили, что нижняя зарплатная граница составляет 71065, а верхняя 110537. Самым популярным сочетанием типа трудоустройста и рабочего графика является "Полный день — Полная занятость". Наибольшее количество вакансий содержит требование о рабочем опыте от 1 года до 3 лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [8]:
# текст запроса
query_5_1 = f'''select count(e.id) employer,
e.name
from EMPLOYERS e, VACANCIES v
where v.employer_id=e.id
group by e.name
order by employer desc
limit 5
'''

In [9]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_8464\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

   employer           name
0      1933         Яндекс
1       491     Ростелеком
2       444       Тинькофф
3       428           СБЕР
4       331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [9]:
# текст запроса
query_5_2 = f'''select a.name area,
count(distinct e.id) employers,
count(distinct v.id) vacancies
from AREAS a
left join  VACANCIES v on v.area_id = a.id
left join  EMPLOYERS e on e.area = a.id
where v.id is null
group by a.id
order by employers desc
'''

In [10]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_16672\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                   area  employers  vacancies
0                Россия        410          0
1             Казахстан        207          0
2    Московская область         75          0
3    Краснодарский край         19          0
4    Ростовская область         18          0
..                  ...        ...        ...
588             Скидель          0          0
589          Белоозерск          0          0
590           Орловский          0          0
591          Павловская          0          0
592             Таксимо          0          0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [4]:
# текст запроса
query_5_3 = f'''select e.name employers,
count(distinct v.area_id) area
from employers e, vacancies v, areas a
where v.area_id = a.id and v.employer_id = e.id
group by e.id
order by area desc
'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_87216\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                                    employers  area
0                                      Яндекс   181
1                                  Ростелеком   152
2                                  Спецремонт   116
3                      Поляков Денис Иванович    88
4                                   ООО ЕФИН     71
...                                       ...   ...
14901                            НПП Авиатрон     1
14902              Центр дистанционных торгов     1
14903  Городские Телекоммуникационные Системы     1
14904                       Введенский, Отель     1
14905              Группа Компаний Автоимпорт     1

[14906 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [16]:
# текст запроса
query_5_4 = f'''select count(e.id) employers
from EMPLOYERS e
left join  EMPLOYERS_INDUSTRIES ei on ei.employer_id = e.id
where industry_id is null
'''

In [17]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_43872\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   employers
0       8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [30]:
# текст запроса
query_5_5 = f'''select e.name employers,
count(industry_id) cnt
from EMPLOYERS e
left join  EMPLOYERS_INDUSTRIES ei on ei.employer_id = e.id
group by e.name
having count(ei.industry_id) = 4
order by employers
'''

In [31]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_43872\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

            employers  cnt
0        101 Интернет    4
1            21vek.by    4
2                2ГИС    4
3                  2К    4
4         4 пикселя +    4
...               ...  ...
1131            ЮРИОН    4
1132  ЮТИП Технологии    4
1133           ЯКласс    4
1134            ЯрНео    4
1135    Яшин&Партнёры    4

[1136 rows x 2 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [88]:
# текст запроса
query_5_6 = f'''select count(ei.employer_id) emp_cnt
from EMPLOYERS_INDUSTRIES ei
left join INDUSTRIES i on i.id = industry_id
where i.name = 'Разработка программного обеспечения'
'''

In [89]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_43872\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   emp_cnt
0     3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [75]:
# код для получения списка городов-милионников
#не смогла разобраться с этим заданием

In [76]:
# текст запроса
query_5_7 = f'''
'''

C:\Users\User\AppData\Local\Temp\ipykernel_33524\196270528.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

DatabaseError: Execution failed on sql '
': can't execute an empty query

In [ ]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

***

In [ ]:
#По количеству вакансий на первом месте находится компания "Яндекс". Наибольшее количество работодателей из России.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [22]:
query_6_1 = f'''select count(v.id) vacancies
from vacancies v
where v.name ilike '%data%' or v.name ilike '%данн%'
'''

In [23]:
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\485020324.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   vacancies
0       1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [30]:
query_6_2 = f'''select count(v.id) vacancies
from vacancies v
where ((v.name ilike '%data scientist%' or
                v.name ilike '%data science%' or
                v.name ilike '%исследователь данных%' or
                v.name ilike '%machine learning%' or
                v.name ilike '%машинн%обучен%') or
                (v.name like '%ML%' and 
                v.name not like '%HTML%')) and (v.name ilike '%junior%' or v.experience ilike '%Нет опыта%' or v.employment ilike '%Стажировка%')
'''

In [31]:
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\3641650667.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   vacancies
0         51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [32]:
# текст запроса
query_6_3 = f'''select count(v.id) vacancies
from vacancies v
where ((v.name ilike '%data scientist%' or
                v.name ilike '%data science%' or
                v.name ilike '%исследователь данных%' or
                v.name ilike '%machine learning%' or
                v.name ilike '%машинн%обучен%') or
                (v.name like '%ML%' and 
                v.name not like '%HTML%')) and (v.key_skills ilike '%SQL%' or v.key_skills ilike '%postgres%')
'''

In [33]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   vacancies
0        201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [35]:
# текст запроса
query_6_4 = f'''select count(v.id) vacancies
from vacancies v
where ((v.name ilike '%data scientist%' or
                v.name ilike '%data science%' or
                v.name ilike '%исследователь данных%' or
                v.name ilike '%machine learning%' or
                v.name ilike '%машинн%обучен%') or
                (v.name like '%ML%' and 
                v.name not like '%HTML%')) and (v.key_skills ilike '%Python%')
'''

In [36]:
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\972386973.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   vacancies
0        351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [49]:
query_6_5 = f'''select round(avg(length(key_skills)-length(replace(key_skills, CHR(9), ''))+1), 2)
from vacancies v
where (v.name ilike '%data scientist%' or
                v.name ilike '%data science%' or
                v.name ilike '%исследователь данных%' or
                v.name ilike '%machine learning%' or
                v.name ilike '%машинн%обучен%') or
                (v.name like '%ML%' and 
                v.name not like '%HTML%')
'''

In [50]:
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\390248827.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [54]:
# текст запроса
query_6_6 = f'''select distinct (v.experience),
round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to)), 0)
from vacancies v
where (v.name ilike '%data scientist%' or
                v.name ilike '%data science%' or
                v.name ilike '%исследователь данных%' or
                v.name ilike '%machine learning%' or
                v.name ilike '%машинн%обучен%') or
                (v.name like '%ML%' and 
                v.name not like '%HTML%')
group by v.experience
'''

In [55]:
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\User\AppData\Local\Temp\ipykernel_33524\3561045109.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience     round
0         Более 6 лет       NaN
1           Нет опыта   74643.0
2  От 1 года до 3 лет  139675.0
3       От 3 до 6 лет  243115.0

***

In [ ]:
# выводы по предметному анализу
#Для начинающего дата-сайентиста есть довольно много подходящих вакансий, но для специалистов уровня джуниор/без опыта/стажировка таких вакансий в десятки раз меньше. Так же мы имеем в полтора раза больше вакансий, где ключевым навыком указан питон, а не sql или postgres.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
#В качестве дополнительного исследования было бы целесообразно провести дополнительный анализ, где можно было бы увидеть требуемые ключевые навыки и регион вакансии, так как, удаленная работа не является самым популярным типом рабочего графика, было бы удобно понимать в каком регионе какие  навыки необходимы.